# Pandas의 데이터 구조 (2) : DataFrame

- Series를 묶어낸 자료형으로, 2차원 배열(=행렬, 표)

In [1]:
import numpy as np
import pandas as pd

### DataFrame 생성

In [6]:
data = {
    'one' : [1, 2, 3, 4, 5]
    , 'two' : ['가', '나', '다', '라', '마']
    , 'three' : [1.23, 2.34, 3.45, 4.56, 5.67]
    , 'four' : True # 모든 list 요소에 length를 맞춰야 하지만, scalar value는 예외로 가능!
}

df = pd.DataFrame(data)
df

   one two  three  four
0    1   가   1.23  True
1    2   나   2.34  True
2    3   다   3.45  True
3    4   라   4.56  True
4    5   마   5.67  True

In [7]:
# python list-dictionary 활용

data = [
    {'a':1,'b':2,'c':3}
    , {'b':5,'c':6}         # 'a'== NaN : Not a Number
    , {'a':7,'b':8,'c':9}
]

df = pd.DataFrame(data)
df

     a  b  c
0  1.0  2  3
1  NaN  5  6
2  7.0  8  9

In [11]:
# NumPy 2차원 ndarray 활용
arr = np.random.randn(2, 3)
df = pd.DataFrame(arr, index=['가', '나'], columns=['A', 'B', 'C'])

df.index = ['1번 학생', '2번 학생']
df.columns = ['귀여움', '사랑스러움', '간지']

df

            귀여움     사랑스러움        간지
1번 학생  0.477327 -0.719378 -0.161325
2번 학생 -0.067135 -1.170134 -0.326963

In [12]:
data = {
    '이름' : ['다람쥐', '원숭이', '호랑이']
    , '위치' : ['독산', '서초', '안양']
    , '성별' : ['F', 'M', 'M']
}
teacher_df = pd.DataFrame(data, index=['Squirrel', 'Monkey', 'Tiger'])
teacher_df

           이름  위치 성별
Squirrel  다람쥐  독산  F
Monkey    원숭이  서초  M
Tiger     호랑이  안양  M

In [13]:
# 전치행렬
teacher_df.T

   Squirrel Monkey Tiger
이름      다람쥐    원숭이   호랑이
위치       독산     서초    안양
성별        F      M     M

### DataFrame 속성

In [15]:
print(teacher_df.index)     # row(행) 식별 --- RangeIndex(기본숫자), Index(label)
print(teacher_df.columns)   # column(열) 식별 --- [RangeIndex(기본숫자)], Index(label)

print(teacher_df.T)

Index(['Squirrel', 'Monkey', 'Tiger'], dtype='str')
Index(['이름', '위치', '성별'], dtype='str')
   Squirrel Monkey Tiger
이름      다람쥐    원숭이   호랑이
위치       독산     서초    안양
성별        F      M     M

In [17]:
print(teacher_df.shape)     # 구조 (형태)
print(teacher_df.size)      # 요소 개수
print(teacher_df.ndim)      # 차원 (깊이)
# print(teacher_df.dtype)   # dataframe은 numpy랑 다르게.. 시리즈 마다 다른 데이터 타입을 가지고 있기 때문에 TYPE이 단일하지 않음.
print(teacher_df.dtypes)    # 요소의 자료형 (컬럼별 자료형)

(3, 3)
9
2
이름    str
위치    str
성별    str
dtype: object

In [19]:
print(teacher_df.values)
print(type(teacher_df.values))

[['다람쥐' '독산' 'F']
 ['원숭이' '서초' 'M']
 ['호랑이' '안양' 'M']]
<class 'numpy.ndarray'>

### DataFrame 메서드

In [20]:
bank_client_df = pd.DataFrame({
    'Client ID' : [1, 2, 3, 4]
    , 'Client Name' : ['Aly', 'Steve', 'Nicole', 'Morris']
    , 'Net worth($)' : [35000, 3000, 100000, 2000]
    , 'Years with bank' : [4, 7, 10, 15]
})

bank_client_df

   Client ID Client Name  Net worth($)  Years with bank
0          1         Aly         35000                4
1          2       Steve          3000                7
2          3      Nicole        100000               10
3          4      Morris          2000               15

In [22]:
print(bank_client_df.head(2))
print(bank_client_df.tail(1))

   Client ID Client Name  Net worth($)  Years with bank
0          1         Aly         35000                4
1          2       Steve          3000                7
   Client ID Client Name  Net worth($)  Years with bank
3          4      Morris          2000               15

In [23]:
bank_client_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Client ID        4 non-null      int64
 1   Client Name      4 non-null      str
 2   Net worth($)     4 non-null      int64
 3   Years with bank  4 non-null      int64
dtypes: int64(3), str(1)
memory usage: 260.0 bytes

In [24]:
bank_client_df.describe()

       Client ID   Net worth($)  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000

### indexing & slicing
- iloc : 행(row), 열(column) 순으로 탐색
- loc : 행(row), 열(column) 순으로 탐색

In [28]:
# iloc
# loc
print(bank_client_df.iloc[0])
print(type(bank_client_df.iloc[0]))
print(bank_client_df.iloc[0].index)
print(bank_client_df.iloc[0].name)

Client ID              1
Client Name          Aly
Net worth($)       35000
Years with bank        4
Name: 0, dtype: object
<class 'pandas.Series'>
Index(['Client ID', 'Client Name', 'Net worth($)', 'Years with bank'], dtype='str')
0

In [32]:
print(type(bank_client_df.iloc[:2]))
bank_client_df.iloc[:2]

<class 'pandas.DataFrame'>

   Client ID Client Name  Net worth($)  Years with bank
0          1         Aly         35000                4
1          2       Steve          3000                7

In [37]:
# Fancy Indexing을 통한 조회는 결과가 1개여도 DataFrame 타입으로 반환(차원유지)
# 일반적인 Indexing (ex. bank_client_df.iloc[0])은 Series ㅌ입으로 반환(차원제거)
print(bank_client_df.iloc[[0]])
print(type(bank_client_df.iloc[[0]]))
bank_client_df.iloc[[0]]     # fancy indexing

   Client ID Client Name  Net worth($)  Years with bank
0          1         Aly         35000                4
<class 'pandas.DataFrame'>

   Client ID Client Name  Net worth($)  Years with bank
0          1         Aly         35000                4

In [39]:
# 2차원 indexing/slicing
bank_client_df.iloc[0, 1] # iloc[행 index, 열 index]

'Aly'

In [41]:
print(type(bank_client_df.iloc[:2, 2:]))
bank_client_df.iloc[:2, 2:] # 행 : 처음부터 2번 앞까지, 열 : 2번부터 끝까지.

<class 'pandas.DataFrame'>

   Net worth($)  Years with bank
0         35000                4
1          3000                7

In [43]:
print(type(bank_client_df.iloc[:2,1])) # 인덱스 슬라이싱을 하지 않으면 series가 됨.. 차원이 사라짐.
# 근데 또 fancy 인덱싱을 하면 차원이 그대로임.
bank_client_df.iloc[:2, 1]

<class 'pandas.Series'>

'Nicole'

In [44]:
bank_client_df.index = ['c1', 'c2', 'c3', 'c4']
bank_client_df

    Client ID Client Name  Net worth($)  Years with bank
c1          1         Aly         35000                4
c2          2       Steve          3000                7
c3          3      Nicole        100000               10
c4          4      Morris          2000               15

In [74]:
# loc => location => index label

# 1. c3의 데이터 조회
print(bank_client_df.loc['c3'])
print()
# 2. c2~c4의 데이터를 2명씩 건너뛰며 조회
# print(bank_client_df.iloc[1::2])
print(bank_client_df.loc['c2':'c4':2])
print()
# 3. 2에서 조회한 데이터의 Client Name만 조회
# print(bank_client_df.iloc[1::2, 1:2])
print(bank_client_df.loc['c2':'c4':2, 'Client Name'])
print()
# 4. 2에서 조회한 데이터의 Client Name 컬럼부터 Net worth [$] 컬럼까지 조회
# print(bank_client_df.iloc[1::2, 1:3])
print(bank_client_df.loc['c2':'c4':2, 'Client Name':'Net worth [$]'])
print()
# 5. 2에서 조회한 데이터의 Client Name과 Years with bank 컬럼만 조회
# print(bank_client_df.iloc[1::2, 1::2])
print(bank_client_df.loc['c2':'c4':2, ['Client Name', 'Years with bank']])

Client ID               3
Client Name        Nicole
Net worth($)       100000
Years with bank        10
Name: c3, dtype: object

    Client ID Client Name  Net worth($)  Years with bank
c2          2       Steve          3000                7
c4          4      Morris          2000               15

c2     Steve
c4    Morris
Name: Client Name, dtype: str

   Client Name
c2       Steve
c4      Morris

   Client Name  Years with bank
c2       Steve                7
c4      Morris               15

In [92]:
# 이름이 Steve인 고객 정보 출력
print(bank_client_df[bank_client_df['Client Name'] == 'Steve'])

    Client ID Client Name  Net worth($)  Years with bank
c2          2       Steve          3000                7

In [95]:
print(bank_client_df[['Client Name', 'Net worth($)']])

   Client Name  Net worth($)
c1         Aly         35000
c2       Steve          3000
c3      Nicole        100000
c4      Morris          2000

### filter()

In [96]:
bank_client_df.filter(items=['Client Name', 'Net worth($)'])

   Client Name  Net worth($)
c1         Aly         35000
c2       Steve          3000
c3      Nicole        100000
c4      Morris          2000

In [97]:
bank_client_df.filter(like='$', axis=1)

    Net worth($)
c1         35000
c2          3000
c3        100000
c4          2000

In [100]:
bank_client_df.filter(like='4', axis=0)

    Client ID Client Name  Net worth($)  Years with bank
c4          4      Morris          2000               15

### 행 추가 및 삭제

In [101]:
students = [
    {'name': '호랑이', 'midterm': 95, 'final': 85},
    {'name': '늑대', 'midterm': 93, 'final': 90},
    {'name': '양', 'midterm': 100, 'final': 10}
]
df = pd.DataFrame(students)
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10

In [ ]:
# 행 추가 1 : loc 이용
df.loc[len(df)] = ['다람쥐', 100, 100]
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3  다람쥐      100    100
4  다람쥐      100    100
5  다람쥐      100    100

In [114]:
# 행 추가 2 : pd.concat() 이용 (== DataFrame 병합)
add_student_df = pd.DataFrame([
    ['개구리', 99, 98]
], columns=['name','midterm', 'final'])
add_student_df

# DataFrame 병합
# ignore_index : 기본의 인덱스를 무시하고 새로운 인덱스를 부여
df = pd.concat([df, add_student_df], ignore_index=True)
df

  name  midterm  final
0   늑대       93     90
1    양      100     10
2  다람쥐      100    100
3  개구리       99     98
4  개구리       99     98

In [ ]:
# 행 삭제 : drop + df.index[] 이용
# df = df.drop(df.index[0])
df = df.drop(df.index[0], inplace=True)
df

  name  midterm  final
0   늑대       93     90
1    양      100     10
2  다람쥐      100    100
3  개구리       99     98

### 컬럼 추가

In [116]:
students = [
    {'name': '호랑이', 'midterm': 95, 'final': 85},
    {'name': '늑대', 'midterm': 93, 'final': 90},
    {'name': '양', 'midterm': 100, 'final': 10}
]
df = pd.DataFrame(students)
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10

In [ ]:
# 컬ㄹ럼 추가 1 : 컬럼명과 기본값 이용
df['과제'] = '제출완료'
df

  name  midterm  final    과제
0  호랑이       95     85  제출완료
1   늑대       93     90  제출완료
2    양      100     10  제출완료

In [ ]:
# 컬럼 추가 2 : 컬럼명과 np.where(조건, True일 때 값, False일 때 값) 이용 => ndarray 이용
df['중간고사 성취도'] = np.where(df['midterm'] == 100, '우수', '보통')
df

  name  midterm  final    과제 중간고사 성취도
0  호랑이       95     85  제출완료       보통
1   늑대       93     90  제출완료       보통
2    양      100     10  제출완료       우수

In [120]:
# 컬럼 추가 3 : 컬럼명과 기본 컬럼 연산 이용
df['개별 평균'] = (df['midterm'] + df['final']) / 2
df

  name  midterm  final    과제 중간고사 성취도  개별 평균
0  호랑이       95     85  제출완료       보통   90.0
1   늑대       93     90  제출완료       보통   91.5
2    양      100     10  제출완료       우수   55.0

In [121]:
# 컬럼 추가 4 : 컬럼명과 apply() 이용
# callback함수를 인자로 넣어줌
def get_result(score) :
    if score > 91 :
        return '상'
    if score < 60 :
        return '하'
    else :
        return '중'

# apply() 처럼 함수를 파라미터로 받는 함수 == 고차함수
df['최종 결과'] = df['개별 평균'].apply(get_result) # 개별 평균이 91보다 크면 상, 60보다 작으면 하, 아니면 중
df

  name  midterm  final    과제 중간고사 성취도  개별 평균 최종 결과
0  호랑이       95     85  제출완료       보통   90.0     중
1   늑대       93     90  제출완료       보통   91.5     상
2    양      100     10  제출완료       우수   55.0     하

In [ ]:
# 컬럼 삭제
# df.drop('중간고사 성취도', axis=1)
df.drop('중간고사 성취도', axis=1, inplace=True)
df

  name  midterm  final    과제  개별 평균 최종 결과
0  호랑이       95     85  제출완료   90.0     중
1   늑대       93     90  제출완료   91.5     상
2    양      100     10  제출완료   55.0     하

### 정렬

In [124]:
bci_df = pd.read_csv('./data/bank_client_information.csv')
bci_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [ ]:
# df는 series와 달리 by로 어떤 컬럼을 기준으로 정렬할 건지가 필수 값
# 자산이 많은 사람 순, acs False!
bci_df.sort_values(by='Net Worth', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [130]:
# 1. 오래된 고객순으로 출력
bci_df.sort_values(by='Years with Bank', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [132]:
# 2. 순자산이 많고 오래된 고객순으로 출력
bci_df.sort_values(by=['Net Worth', 'Years with Bank'], ascending=[False, True])

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [135]:
bci_df['Rank'] = bci_df['Net Worth'].rank(ascending=False).astype(int)
bci_df.sort_values('Rank')

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,1
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,2
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,4
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,5
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,6
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,7
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,8
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,10